{
    "shale": {
        "name": "หินดินดาน",
        "type": "หินตะกอน",
        "source": "โดยทั่วไปแหล่งผลิตหินดินดานส่วนใหญ่จะอยู่ใกล้กับโรงงาน ปูนซีเมนต์",
        "location": "จังหวัดสระบุรี รองลงมา คือ จังหวัดนครศรีธรรมราช และลำปาง",
        "usage": "ใช้เป็นวัตถุดิบในอุตสาหกรรมปูนซีเมนต์"
    },

    "sandstone": {
        "name": "หินทราย",
        "type": "หินตะกอน",
        "source": "เกิดจากการสะสมตัวของเศษหินดินทราย ที่แตกหลุด และการพังทลายของหินอื่นหรือถูกละลายชะ ล้างมาจากดินหรือหินอื่นๆ แล้วถูกกระแสน้ำหรือกระแสลมทับถมอยู่เป็นชั้นๆ",
        "location": "พบมากทางภาคตะวันออกเฉียงเหนือ จังหวัดราชบุรี เพชรบุรี กาญจนบุรี และทางภาคใต้บางแห่ง",
        "usage": "ตกแต่งบ้านและสวน"
    },

    "marble": {
        "name": "หินอ่อน",
        "type": "หินแปร",
        "source": "เริ่มต้นมาจากหินปูนหรือแคลเซียมคาร์บอเน็ต ที่มีผลึกแร่คัลไซต์เป็นส่วนประกอบหลัก เกิดการทับถมกันเป็นชั้น ประกอบกับความร้อนและแรงดันที่เกิดจากแมกมาของภูเขาไฟใต้ทะเล และปัจจัยสภาพแวดล้อมทางธรณีวิทยาอันหลากหลาย จนเกิดการประสานกันของผลึกภายในตัวหิน ทำให้หินมีลวดลายที่สวยงาม ประกอบด้วยเส้นสีสันต่างๆ อันเป็นเอกลักษณ์เฉพาะตัว",
        "location": "พบมากที่ จังหวัดสระบุรี ลพบุรี ลำปาง และกาญจนบุรี",
        "usage": "ใช้เป็นวัสดุก่อสร้างและหินประดับ เช่น ปูพื้นอาคาร, ปูผนัง, ทำขั้นบันได, โต๊ะ, และรูปสลักต่างๆ"
    },

    "granite": {
        "name": "หินแกรนิต",
        "type": "หินอัคนี",
        "source": "เกิดจากการหลอมเหลวของลาวาที่เย็นตัวลง และเกิดการตกผลึกภายใต้แรงดันมหาศาลใต้เปลือกโลก จนเกิดหินที่ประกอบด้วยผลึกแร่ขนาดใหญ่อย่างหินแกรนิตขึ้น",
        "location": "พบได้ทั่วไปทั้งภาคตะวันออก ภาคเหนือ และภาคใต้ เหมืองหินแกรนิต นครนายก ยะลา เลย ฉะเชิงเทรา กาญจนบุรี เพชรบุรี ตาก ราชบุรี ประจวบคีรีขันธ์ สุพรรณบุรี นครราชสีมา ลำปาง อุทัยธานี นครสวรรค์ เพชรบูรณ์ สุโขทัย จันทบุรี พิจิตร สงขลา ปราจีนบุรี ลพบุรี ชลบุรี ระยอง กำแพงเพชร",
        "usage": "ใช้ทำหินประดับ หินแกะสลักทำอนุสาวรีย์ วัสดุก่อสร้าง"
    },

    "limestone": {
        "name": "หินปูน",
        "type": "หินตะกอน",
        "source": "เกิดจากการทับถมของซากเปลือกหอยหรือสิ่งมีชีวิตอื่นๆ ที่อาศัยอยู่ในทะเล หรือการตะกอนทางเคมี การตกผลึก การเกิดผลึกใหม่",
        "location": "พบได้ทั่วไปเกือบทุกภาค ยกเว้นภาคอีสานตอนกลาง โดยพบมากใน จังหวัดสระบุรี เพชรบุรี กระบี่ ลำปาง พังงา เชียงราย เชียงใหม่ เป็นต้น",
        "usage": "ใช้เป็นหินอุตสาหกรรมก่อสร้าง และผลิตซีเมนต์ น้าไปเผาท้าปูนขาว หรือปูน กินหมาก ท้าแคลเซียมคาร์ไบด์ ท้าวัสดุทนไฟ ท้าปุ๋ย และท้าสี"
    },

    "quartzite": {
        "name": "หินควอร์ตไซต์",
        "type": "หินแปร",
        "source": "เกิดจากการตกผลึกใหม่ของหินจำพวกหินทรายที่ได้รับอิทธิพลจาก ความร้อนเป็นหลัก",
        "location": "พบทั่วไปตามจังหวัด ชลบุรี ประจวบคีรีขันธ์ สงขลา กำแพงเพชร และอุตรดิตถ์",
        "usage": "ใช้ในอุตสาหกรรมเครื่องแก้ว ท าหินลับมีด และหินประดับ"
    }
}